app/controllers/klasses_controller.rb

SELECT "klasses".* FROM "klasses"
---
  def index
    @klasses = Klass.all

SELECT "klasses".* FROM "klasses" WHERE "klasses"."id" = $1 LIMIT 1  [["id", "new"]]
---
  def show
    @klass = Klass.find(params[:id])