app/controllers/students_controller.rb

  def index
    @students = Student.all || 0
---
SELECT "students".* FROM "students"

  def create
    @klass = Klass.find(params[:klass_name])
    @student = Student.new({:name => params[:name]})
    Klasses_students.create({
      :klass_id => @klass.id
      :student_id => @student.id
    })
---
INSERT INTO "students" ("class_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["class_id", nil], ["created_at", Thu, 20 Mar 2014 15:39:10 UTC +00:00], ["name", "Barney Rubble"], ["updated_at", Thu, 20 Mar 2014 15:39:10 UTC +00:00]]

  def update
    @student = Student.find(params[:id])

    @student.update_attributes({
      :name => params[:name]
    })
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "students" SET "name" = 'Barne', "updated_at" = '2014-03-20 15:46:31.613295' WHERE "students"."id" = 1