app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new({:name => params[:name]})

    if @teacher.save
---
INSERT INTO "teachers" ("class_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["class_id", nil], ["created_at", Thu, 20 Mar 2014 15:26:32 UTC +00:00], ["name", "Sumeet Jain"], ["updated_at", Thu, 20 Mar 2014 15:26:32 UTC +00:00]]

  def update
    @teacher = Teacher.find(params[:id])

    @teacher.update_attributes({:name => params[:name]})
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "teachers" SET "name" = 'Sumeet', "updated_at" = '2014-03-20 15:47:19.734569' WHERE "teachers"."id" = 1

  def delete
    @teacher = Teacher.find(params[:id])

    @teacher.delete
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "teachers" WHERE "teachers"."id" = 2